Revit 2027 API
ImageExportOptions.PixelSize Property
 The pixel size of an image in one direction. Used only if ZoomType is FitToPage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PixelSize { get; set; }
Public Property PixelSize As Integer
	Get
	Set
public:
property int PixelSize {
	int get ();
	void set (int value);
}
member PixelSize : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The PixelSize value is outside the permitted range.
Remarks
 The default is 512 pixels.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace